blog/2016-06-23-dns和bind.org
#+TITLE: DNS和BIND
#+DATE: 2016-06-23
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linux
#+JEKYLL_TAGS: Linux 运维 网络
#+JEKYLL_PUBLISHED: true

TODO




-----
* DNS
DNS: Domain Name Service，应用层协议(53/udp, 53/tcp)
** hosts
/etc/hosts是本地名称解析配置文件
#+BEGIN_SRC conf
1.1.1.1 www.qiump.com
1.2.2.2 www.apple.com
#+END_SRC
** 顶级域
Top Level Domain(tld): com, edu, mil, gov, net, org, int
- 顶级域分为三类: 组织域、国家域、反向域
** 名称服务器
名称服务器(NS)是域内负责解析本域内的名称的主机
- 根服务器: 13组服务器
- 子域授权：每个域的名称服务器，都是通过其上级名称服务器在解析库进行授权
** DNS解析
- FQDN: Full Qualified Domain Name，每个网址最后都有个 =.= 表示根，只是浏览器上会省略
- 正向区域: FQDN -> IP
- 反向区域: IP -> FQDN
- 正反向解析是两个不同的名称空间，是两棵不同的解析树，各需要一个解析库来分别负责本地域名的正向和反向解析
** DNS服务器的类型
- 主DNS服务器: 维护所负责解析的域内解析库服务器，解析库由管理员维护
  - "通知"机制: 当主DNS服务器内容发生改变时会通知从DNS服务器
- 从DNS服务器: 从主DNS服务器或其它的从DNS服务器那里复制（区域传递）一份解析库
  - 序列号：解析库的版本号；前提：主服务器解析库内容发生变化，其序列递增
  - 刷新时间间隔：从服务器从主服务器请求同步解析库的时间间隔
  - 重试时间间隔：从服务器从主服务器请求同步解析库失败时，再次尝试的时间间隔
  - 过期时长：从服务器始终联系不到主服务器时，多久多后放弃从服务器角度，停止提供服务
  - 区域传送: 全量传送，增量传送
- 缓存DNS服务器: 使用hash进行缓存
- 转发器
** 一次查询请求的流程
- 过程: Client -> hosts文件 -> Local Cache -> DNS Server -> Server Cache -> iteration
- 特殊查询结果
  - 否定答案：请求的条目不存在等原因导致无法返回结果，同样也会缓存
  - 非权威答案：由缓存查询而来
** 资源记录RR
- 区域解析库由众多资源记录RR(Resource Record)组成
*** 记录类型
- SOA：Start Of Authority，起始授权记录；一个区域解析库有且仅能有一个SOA记录，而必须为解析库的第一条记录
- A：internet Address，作用，FQDN --> IP
- AAAA: FQDN --> IPv6
- PTR: PoinTeR，IP --> FQDN
- NS: Name Server，专用于标明当前区域的DNS服务器
- CNAME：Canonical Name，别名记录
- MX:　Mail eXchanger，邮件交换器
*** 资源记录的格式
**** 语法
#+BEGIN_SRC sh
name [TTL] IN RR_type value
  TTL: RR缓存时间
#+END_SRC
1. TTL可从全局继承
2. @可用于引用当前区域的名字
3. 相邻的两个资源记录的name相同时，后续的可省略
**** SOA
- name: 当前区域的名字，例如 =qiump.com.=
- value: 由多部分组成
  1. 当前区域的主DNS服务器的FQDN，也可以使用当前区域的名字
  2. 当前区域管理员的邮箱地址，但地址中不能使用@符号，使用.替换
  3. 主从服务协调属性的定义以及否定的答案的统一的TTL
#+BEGIN_SRC dns
qiump.com.  86400  IN  SOA  @  qiumupo.qq.com.  (
    20160627 ;序列号
    2H  ;刷新时间
    10M  ;重试时间
    1W  ;过期时间
    1D  ;否定答案
)
#+END_SRC
**** NS
- name: 当前区域的名字
- value: 当前区域的某DNS服务器的名字
#+BEGIN_SRC dns
qiump.com.	 IN  NS  ns1.qiump.com.
qiump.com.	 IN  NS  ns2.qiump.com.
#+END_SRC
- 任何一个NS记录后面的value，都应该在后续有一个A记录
**** MX
- name: 当前区域的名字
- value: 当前区域的某邮件服务器(smtp服务器)的主机名
  - 每个记录的value之前应该有一个数字(0-99)，表示此服务器的优先级，数字越小优先级越高
#+BEGIN_SRC dns
qiump.com.	 IN  MX  10  mx1.qiump.com.
             IN  MX  20  mx2.qiump.com.
#+END_SRC
- 任何一个MX记录后面的value，都应该在后续有一个A记录
**** A
- name: 某主机的FQDN
- value: 主机名对应的主机的IPv4地址
#+BEGIN_SRC dns
www.qiump.com.  IN  A  1.1.1.1
www.qiump.com.  IN  A  1.1.1.2
qiump.com.  IN  A  1.1.1.1

*.qiump.com.  IN  A  1.1.1.4  ;当用户写错名称时，会解析至此地址
#+END_SRC
- 同一个name可以有多个不同的value，服务器会轮询解析
- 同一个value也可以有多个不能的name
**** AAAA
- name: FQDN
- value: IPv6
**** CNAME
name: 别名的FQDN
value: 原名字的FQDN
**** PTR
- name: 特定格式的IP地址，要把IP地址反过来写，同时加上后缀 =in-addr.arpa.=
- value: FQDN
#+BEGIN_SRC dns
2.1.1.1.in-addr.arpa.  IN  PTR  www.qiump.com.
2  IN  PTR  www.qiump.com.  ;网络地址及后缀可省略
#+END_SRC
* BIND
BIND：Bekerley Internat Name Domain
** 程序包
- bind
- bind-libs
- bind-utils: dig, host, nslookup, nsupdate
- bind-chroot: /var/named/chroot
- 程序名: named
** bind组成
- 服务脚本：/etc/rc.d/init.d/named
- 主配置文件：/etc/named.conf, /etc/named.rfc1912.zones, /etc/rndc.key
- 解析库文件：/var/named/ZONE_NAME.zone
  - 必须要有根区域.文件: named.ca
  - 应该有两个(或ipv6)实现localhost和本地回环地址的解析库
- 日志文件: /var/log/named.log
- rndc: remote name domain controller，默认与bind安装在同一主机，且只能通过127.0.0.1:953来连接named进程，用于提供辅助性的管理功能
** 主配置文件
- 全局配置：options {}
  - listen-on: 用于配置监听的端口和IP
  - =allow-query { any; };=: 允许任何主机查询
- 日志子系统配置：logging {}
- 区域定义：zone "ZONE_NAME" IN {}
  - type {master|slave|hint|forward}
** 缓存名称服务器
- 直接监听外部地址即可
- dnssec: 用于防止dns污染，测试时一般关闭
** 主DNS服务器
1. 在主配置文件中定义区域(一般在 =named.rfc1912.zones= 中定义)
   #+BEGIN_SRC conf
   zone "ZONE_NAME" IN {
       type master;
	   file "ZONE_NAME.zone";
   };
   #+END_SRC
2. 定义区域解析库文件
   - 定义在 /var/named/ZONE_NAME.zone
   - 文件属组应为named，权限为640
   #+BEGIN_SRC zone
   $TTL 86400  ;定义默认的TTL
   $ORIGIN qiump.com.  ;为后缀不是.的地址补全后缀
   @	IN	SOA	ns1.qiump.com.	admin.qiump.com (
     20160627 ;序列号
     2H  ;刷新时间
     10M  ;重试时间
     1W  ;过期时间
     1D  ;否定答案
     )
   		IN	NS	ns
   		IN	MX 10	mx
   ns	IN	A	172.16.100.11
   mx	IN	A	172.16.100.12
   www	IN	A	172.16.100.11
   www	IN	A	172.16.100.12
   ftp	IN	CNAME	www
   #+END_SRC
3. 检查配置文件
   #+BEGIN_SRC sh
   named-checkconf
   named-checkconf "qiump.com" /var/named/qiump.com.zone
   #+END_SRC
* 相关命令
** dig
dig用于查询DNS系统，并不会查询hosts文件
#+BEGIN_SRC conf
dig [-t type] name [@SERVER] [query options]  # 正向解析
  type: 查询的RR类型
  SERVER: 指定使用的DNS服务器

  +[no]trace: 跟踪解析过程
  +[no]recurse: 进行递归解析
#+END_SRC
